## Importing Libraries

In [1]:
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt

## Importing Dataset.

Here,we have used the Population Dataset of World Bank.

In [2]:
df = pd.read_csv('Population_Database.csv')

In [3]:
df.head()

         Country       Male     Female   Male (%)  Female ( %)  Population
0  1960 [YR1960]  232504741  218042938  51.604914    48.395086   450547679
1  1961 [YR1961]  237313421  222328744  51.630037    48.369963   459642165
2  1962 [YR1962]  242296454  226780736  51.653856    48.346144   469077190
3  1963 [YR1963]  247438411  231387197  51.676102    48.323898   478825608
4  1964 [YR1964]  252717316  236130819  51.696488    48.303512   488848135

## Null Values

In [4]:
df.isnull().sum()

Country        0
Male           0
Female         0
Male (%)       0
Female ( %)    0
Population     0
dtype: int64

## Renaming the column *Country* to *Year*

In [5]:
df.rename(columns={'Country' : 'Year'},inplace=True)

In [6]:
df.head()

            Year       Male     Female   Male (%)  Female ( %)  Population
0  1960 [YR1960]  232504741  218042938  51.604914    48.395086   450547679
1  1961 [YR1961]  237313421  222328744  51.630037    48.369963   459642165
2  1962 [YR1962]  242296454  226780736  51.653856    48.346144   469077190
3  1963 [YR1963]  247438411  231387197  51.676102    48.323898   478825608
4  1964 [YR1964]  252717316  236130819  51.696488    48.303512   488848135

In [7]:
df['Year'] = df.Year.str.split(" ",expand=True)

In [8]:
df.head()

   Year       Male     Female   Male (%)  Female ( %)  Population
0  1960  232504741  218042938  51.604914    48.395086   450547679
1  1961  237313421  222328744  51.630037    48.369963   459642165
2  1962  242296454  226780736  51.653856    48.346144   469077190
3  1963  247438411  231387197  51.676102    48.323898   478825608
4  1964  252717316  236130819  51.696488    48.303512   488848135

In [9]:
df.to_csv('../3. Exploratory Data Analysis/Population.csv')
df.to_csv('../4. Model Building/Population.csv')